animals = ['медведь', 'питон', 'пингвин', 'кенгуру', 'кит', 'утконос']
print("Второе животное имеет индекс 1 и это",animals[1])
print("Животное с индексом 2 является первым,и это",animals[2])
print("Первое животное имеет индекс 0 и это",animals[0])
print("Четвертое животное имеет индекс 3 и это",animals[3])
print("Пятое животное имеет индекс 4 и это",animals[4])
print("Шестое животное имеет индекс 5 и это",animals[2])
print("Животное с индексом 5 является 4-ым и это",animals[5])
print("третье животное иммет индекс 4 и это",animals[3])
