from sys import exit
from tracemalloc import start


# алтын бар бөлме
def gold_room():
    print("Здесь полно золота. Сколько кг ты унесешь?")
    
    # егер 0 немесе 1 таңдасақ оны инт типіне айналдырады
    choice = input("> ")
    if "0" in choice or "1" in choice:
        how_much = int(choice)
        #егер ештеңе таңдамасақ dead фнукциясы шақырылып біз ойыннан шығып кетеміз
    else:
        dead("Эй,вести надо число.")
    
    # егер таңдаған алтын санымыз 50-ден кіші болса жеңдік және ойыннан шығып кетеміз
    if how_much < 50:
        print("Шикарно! Ты не жадный,поэтому выигрываешь!")
        exit(0)
    else:
        #егер 50-ден көп алтын алатын болсақ dead функциясын шақырамыз
        dead("Ах ты жадина!")


# аюы бар бөлме
def bear_room():
    print("Здесь сидит медведь.")
    print("У медведя бочка с медом")
    print("Медведь закрыл собой дверь выхода.")
    print("Как переместить медведя? Отобрать мед или подрзанит медведя?")
    
    #аю қозғалды дегенді фолс қоямыз --> 
    bear_moved = False
    
    # фолс болғанға дейін орындалады
    while True:
        choice = input("> ")
          
        #егер аюдан балын тартып алсақ онда біз ойыннан шығамыз
        if choice == "отобрать мед":
            print("Медведь посмотрел на тебя и ударил лапой по лицу.")
            #егер подразнить медведя таңдасақ және аю қозғалған болса
        elif choice == "подразнить медведя" and not bear_moved:
            print("Медведь отошел от двери.")
            print("Вы можете войни в нее. Подразнить медведя или войти в дверь?")
            bear_moved = True
            
            #онда аю қозғалған болады
        elif choice == "подразнить медведя" and bear_moved:
            #онда поздразнить медведя тандасак және аюдың қозғалмаған  болса біз ойыннан шығамыз
            dead("Медведь разозлился и откусил тебе ногу.")
        elif choice == "войти в дверь" and bear_moved:
            #онда есікке кіруді таңдаcақ және аю қоз,алмаған болса-->біз алтынбар бөлмеге кіреміз
            gold_room()
        else:
            #егер ештене жазбасақ немесе басқа қадам  таңдасақ қолданушыға хат жібереміз
            print("Введите одно из предложеных действий")


# бөлмеге кіреміз
def cthulhu_room():
    print("На тебя смотрит великий и ужасный Ктулху.")
    print("Он смотрит на тебя, и ты начинаешь сходить с ума.")
    print("Убежать или начать сражаться")
    
    
    #қадамды таңдаймыз
    choice = input("> ")
    if "убежать" in choice:
        # егер қашуды таңдасақ start функциясы шақыралды яғни ойын жаңадан басталады
        start()
    elif "начать сражаться" in choice:
        # егер "шайқасуды" таңдасақ жеңілеміз және ойыннан шығып кетеді
        dead("Хм,возможно,даже удастся победить!")  
    else:
        #басқа қадам таңдаса осы бөлмеге қайтдан кіреміз
        cthulhu_room()
        

# қате ойын шарты болғанда шақырылады - не үшін жеңілгені немесе жеңгені үшін              
def dead(why):
    print(why,"Великолепно!")
    exit(0)
 
# start- функциясы ешққандай параметр қабылдамайды.
# ол бірден қолданушыға программа іске қосылған кезде шығады.    
def start():
    print("Ты в темной комнате.")
    print("Отсюда ведут две двери, налево и направо.")
    print("Куда ты повернешь?")
    
    #бірінші бұрылу бағытын таңдаймыз
    choice = input("> ")
    
    # егер солға болса аюы бар бөлмеге кіреміз
    if choice == "налево":
        bear_room()
    elif choice =="направо":
        #егер оңға болса ктулху бар бөлмеге кіреміз.
        cthulhu_room()
    else:
        #болмаса dead функциясы шақырылады
        dead("Ты ходишь из комнаты в комнату, пока не умираешь с голоду.")
        

# start деген функцияны шақырамыз
start()                                    